chore: tidy up docs and source code
